In [1]:
import pandas as pd

In [2]:
# Melt function

In [3]:
df = pd.DataFrame({"A" : {0: "a", 1: "b", 2: "c"},
                  "B" : {0: 1, 1: 3, 2: 5},
                  "C" : {0: 2, 1: 4, 2: 6}
                  })
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [4]:
# melt the data
df.melt(id_vars=["A"], value_vars=["B"])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [5]:
# expolde funciton transform each element of a list-like to a row, replicanting index values
df = pd.DataFrame({"A": [[1,2,3], "foo", [], [3,4]] , "B": 1})
df

           A  B
0  [1, 2, 3]  1
1        foo  1
2         []  1
3     [3, 4]  1

In [6]:
df.explode("A")

     A  B
0    1  1
0    2  1
0    3  1
1  foo  1
2  NaN  1
3    3  1
3    4  1

In [7]:
# Squeex function
df = pd.DataFrame([[1,2],[3,4]], columns=["a", "b"])
df

   a  b
0  1  2
1  3  4

In [8]:
# slicing a single column will produce a dataframe with the columns having only one value
df_a = df[["a"]]
df_a

   a
0  1
1  3

In [9]:
df_a.squeeze()

0    1
1    3
Name: a, dtype: int64